#include <iostream>
#include <algorithm>
#include <iomanip>
using namespace std;

int main()
{

    int n;//n水龙头前排队接水的人数
    cin >> n;


    int N[1000];//数组N，用于存储每个人接水的时间,N[i]表示第i个人的接水时间
    for (int i = 0; i < n; i++)
        cin >> N[i];


    int T[1000];//数组T，用于复制数组N中的元素
    for (int i = 0; i < n; i++)
        T[i] = N[i];

    sort(T, T + n);//使用标准库中的sort函数对数组T进行排序（从小到大排序）

    double sum = 0;//sum，用于累加计算所有人等待时间的总和，初始化为0

    int temp[1000];//定义临时数组temp，同样大小为1000
    for (int i = 0; i < n; i++)
        temp[i] = N[i];//用于辅助后续查找每个人接水时间在原数组中的原始位置等操作，初始时将N数组元素复制过来

    /*遍历排序后的数组T
      以按照接水时间从小到大的顺序确定排队顺序，并计算相应的等待时间以及累加总和*/
    for (int i = 0; i < n; i++)
    {
        /*逐个比较查找当前排序后数组T中元素（即当前接水时间）
          在原数组temp中的原始位置（下标），初始j为0
          这个原始位置就对应着最初输入的第几个接水人的序号，找到这个序号才能按要求输出排队顺序*/
        int j = 0;
        while (temp[j]!= T[i])
            j++;

        /*找到元素在temp数组中的位置后，将该位置的元素值置为0
          避免后续重复查找（标记已处理过），同时这一步也是为了配合查找逻辑的正确性
          确保每次都能准确找到下一个未处理的对应元素位置*/
        temp[j] = 0;


        /*如果当前不是最后一个元素，就在输出位置序号后添加一个空格
          用于隔开不同接水人的序号，使输出格式更清晰*/
        if (i!= n - 1)

        /*根据题目要求计算加权总和，权重是(n - i - 1)
          表示当前这个人前面有(n - i - 1)个人需要等待他接水
          所以每个人的等待时间就是他的接水时间乘以前面等待的人数，
          这里乘以当前元素值（转换为浮点数类型）累加到sum中
          用于后续计算平均等待时间*/
        sum += T[i] * (n - i - 1) * 1.0;
    }


    /*输出这种排列方案下的平均等待时间*/
    cout << fixed << setprecision(1) << sum / (n * 1.0);

    return 0;
}
